/******** 战斗参数 **********
    T：战斗的标准回合数，设为常数10。Hp=(atk-def)*T
    暴击率：0.1         以下战斗中概率数值的设定不能超过0.666（因为实战中增幅最大接近1.5倍）
    攻击被格挡率：0.3
    攻击被闪避率：0.1 （攻击命中但没有暴击的几率=1-暴击率-攻格率-攻闪率=0.5）
    破防率：0.06
    防守时闪避率：0.3 （防守时格挡率=1-破防率-防闪率=0.603）
    闪避时反击率：0.2 （是在已经闪避的基础上再用此概率计算是否反击，总的概率其实是0.06）
    格挡时反击率：0.2 （是在已经格挡的基础上再用此概率，总的概率其实是0.1206）
****************************/
var combatConfig = {
    T: 10,
    BaoJi: 0.1,
    AGe: 0.3,
    AShan: 0.1,
    PoFang: 0.06,
    DShan: 0.3,
    SFan: 0.2,
    GFan: 0.2,
};

module.exports = {
    combat: combatConfig
};